#### Glazing Members

---

|  |
| --- |
| Glazing Class   Properties   See Also |

The  Glazing  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CommonTintColor | The property labeled "Tint Color" from the "Glazing" schema. |
| Public property Static member | CommonTintToggle | The property labeled "Tint" from the "Glazing" schema. |
| Public property Static member | GlazingColorByObject | The property labeled "Color By Object" from the "Glazing" schema. |
| Public property Static member | GlazingNoLevels | The property labeled "Sheets of Glass" from the "Glazing" schema. |
| Public property Static member | GlazingReflectance | The property labeled "Reflectance" from the "Glazing" schema. |
| Public property Static member | GlazingTransmittanceColor | The property labeled "Color" from the "Glazing" schema. |
| Public property Static member | GlazingTransmittanceMap | The property labeled "Custom Color" from the "Glazing" schema. |

# See Also

Glazing Class

Autodesk.Revit.DB.Visual Namespace